{
  "name": "Game Manager",
  "version": "v2.8.0",
  "type": "TOOL",
  "description": "A one-stop pak for all your game management needs.",
  "author": "K-Wall & redria7",
  "repo_url": "https://github.com/UncleJunVIP/nextui-game-manager",
  "release_filename": "Game.Manager.pak.zip",
  "banners": {
    "BRICK": ".github/resources/banner.png"
  },
  "changelog": {
    "v2.8.0": "Updated the system tag mappings to help find game art for more platforms.",
    "v2.7.1": "Updated filter screen formatting to show the full time.",
    "v2.7.0": "A new filtering option for the Play History Tool!",
    "v2.6.0": "Behind the scenes collection enhancements, fix for the art downloader missing exact name matches, you can now jump pages (D-Pad Left / Right) while reordering games in a collection and new option in the collection options screen to alphabetize the games.",
    "v2.5.0": "Added a new Play History tool allowing for viewing of all current game tracking history. Includes total hours, hours by console, hours by game, ROM location tagging, ROM collection tagging, a play summary screen, and a granular detail screen. Play summary and granular detail screens can also be accessed from game actions.",
    "v2.4.1": "Added clear recently played to the global actions tool. Thanks madeleineostoja for the suggestion!",
    "v2.3.0": "Enhanced art searching that uses a fallback Jaccard Similarity with configurable threshold when art with an exact filename match does not exist.",
    "v2.2.2": "Archiving / Unarchiving Multi Disk and BIN/CUE games now works as intended. Nested folders now work with the Global Actions Missing Art tool. Shoved Global Actions into a Tool Menu for future Pak expansion.",
    "v2.2.0": "Nice little update for y'all. Added art images to the games list, added a global action menu for downloading all missing art and now art can be found for nested folders. Also three bugfixes; bulk adding games to collections should be more reliable, redria7 added a robust system for keeping track of the last selected list item and toastd figured out why art could not be found for some games.",
    "v2.1.1": "Bugfixes",
    "v2.1.0": "Enhanced archiving features courtesy of redria7!",
    "v2.0.1": "Small fix in UI library for artifacts that appeared when no bg.png is present.",
    "v2.0.0": "Huge UI refresh along with long requested bugfixes."
  },
  "platforms": [
    "tg5040"
  ],
  "launch": "launch.sh"
}
